In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
label=["a","b","c"]
my_data=[10,20,30]
arr=np.array(my_data)
d={"a":10,"s":20,"c":30}

In [4]:
n=pd.Series(data=my_data,index=label)

In [5]:
n

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(data=my_data,index=label)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(d)

a    10
s    20
c    30
dtype: int64

In [126]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [127]:
pd.Series(label,my_data)

10    a
20    b
30    c
dtype: object

In [128]:
ser1=pd.Series([1,2,3,4],["u","g","s","f"])

In [129]:
ser1

u    1
g    2
s    3
f    4
dtype: int64

In [130]:
ser2=pd.Series([1,2,3,4],["u","g","p","f"])

In [131]:
ser2

u    1
g    2
p    3
f    4
dtype: int64

In [132]:
ser2['u']

1

In [133]:
ser3=pd.Series(label)

In [134]:
ser3

0    a
1    b
2    c
dtype: object

In [135]:
 ser3[0]

'a'

In [136]:
 ser1+ser2

f    8.0
g    4.0
p    NaN
s    NaN
u    2.0
dtype: float64

# Dataframes

In [137]:
import pandas as pd

In [138]:
from numpy.random import randn

In [139]:
np.random.seed(101)

In [140]:
df=pd.DataFrame(randn(3,3),["a","b","c"],["w","y","z"])

In [141]:
df

          w         y         z
a  2.706850  0.628133  0.907969
b  0.503826  0.651118 -0.319318
c -0.848077  0.605965 -2.018168

In [142]:
df["w"]

a    2.706850
b    0.503826
c   -0.848077
Name: w, dtype: float64

In [143]:
type(df["w"])

pandas.core.series.Series

In [144]:
df["w"]

a    2.706850
b    0.503826
c   -0.848077
Name: w, dtype: float64

In [145]:
df["n"]=df["w"]+df["y"]

In [146]:
df

          w         y         z         n
a  2.706850  0.628133  0.907969  3.334983
b  0.503826  0.651118 -0.319318  1.154944
c -0.848077  0.605965 -2.018168 -0.242112

In [147]:
df.drop("n",axis=1)

          w         y         z
a  2.706850  0.628133  0.907969
b  0.503826  0.651118 -0.319318
c -0.848077  0.605965 -2.018168

In [148]:
df

          w         y         z         n
a  2.706850  0.628133  0.907969  3.334983
b  0.503826  0.651118 -0.319318  1.154944
c -0.848077  0.605965 -2.018168 -0.242112

In [149]:
df.drop("n",axis=1,inplace=True)

In [150]:
df

          w         y         z
a  2.706850  0.628133  0.907969
b  0.503826  0.651118 -0.319318
c -0.848077  0.605965 -2.018168

In [151]:
df.drop("a")

          w         y         z
b  0.503826  0.651118 -0.319318
c -0.848077  0.605965 -2.018168

In [71]:
df

          w         y         z
a  2.706850  0.628133  0.907969
b  0.503826  0.651118 -0.319318
c -0.848077  0.605965 -2.018168

In [152]:
df.shape

(3, 3)

In [153]:
df.loc["a"]

w    2.706850
y    0.628133
z    0.907969
Name: a, dtype: float64

In [154]:
df.iloc[2]

w   -0.848077
y    0.605965
z   -2.018168
Name: c, dtype: float64

In [155]:
df.loc["b","y"]

0.6511179479432686

In [157]:
df>0

       w     y      z
a   True  True   True
b   True  True  False
c  False  True  False

In [158]:
df[df>0]

          w         y         z
a  2.706850  0.628133  0.907969
b  0.503826  0.651118       NaN
c       NaN  0.605965       NaN

In [159]:
df

          w         y         z
a  2.706850  0.628133  0.907969
b  0.503826  0.651118 -0.319318
c -0.848077  0.605965 -2.018168

In [160]:
df["w"]>0

a     True
b     True
c    False
Name: w, dtype: bool

In [161]:
df[df["w"]>0]

          w         y         z
a  2.706850  0.628133  0.907969
b  0.503826  0.651118 -0.319318

In [162]:
df

          w         y         z
a  2.706850  0.628133  0.907969
b  0.503826  0.651118 -0.319318
c -0.848077  0.605965 -2.018168

In [163]:
df[df["w"]>0][["y","z"]]

          y         z
a  0.628133  0.907969
b  0.651118 -0.319318

In [164]:
df[df["w"]>0][["y","z"]]

          y         z
a  0.628133  0.907969
b  0.651118 -0.319318

In [165]:
df[(df["w"]>0) & (df["y"]<0)]

Empty DataFrame
Columns: [w, y, z]
Index: []

In [166]:
newind="aa bb cc".split()

In [167]:
df["x"]=newind

In [168]:
df["x"]

a    aa
b    bb
c    cc
Name: x, dtype: object

In [169]:
df.reset_index()

  index         w         y         z   x
0     a  2.706850  0.628133  0.907969  aa
1     b  0.503826  0.651118 -0.319318  bb
2     c -0.848077  0.605965 -2.018168  cc

In [170]:
df.set_index("x")

           w         y         z
x
aa  2.706850  0.628133  0.907969
bb  0.503826  0.651118 -0.319318
cc -0.848077  0.605965 -2.018168

In [171]:
df

          w         y         z   x
a  2.706850  0.628133  0.907969  aa
b  0.503826  0.651118 -0.319318  bb
c -0.848077  0.605965 -2.018168  cc

In [302]:
outside="G1 G1 G1 G2 G2 G2".split()
inside=[1,2,3,1,2,3]
heir_index=list(zip(outside,inside))

In [303]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [177]:
heir_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [212]:
heir_index=pd.MultiIndex.from_tuples(heir_index,names=[1,2])

In [213]:
heir_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           names=[1, 2])

In [214]:
df=pd.DataFrame(randn(6,2),heir_index,["a","b"])

In [215]:
df

             a         b
1  2
G1 1 -0.754070 -0.943406
   2  0.484752 -0.116773
   3  1.901755  0.238127
G2 1  1.996652 -0.993263
   2  0.196800 -1.136645
   3  0.000366  1.025984

In [209]:
df.loc["G1"]

          a         b
2
1  1.693723 -1.706086
2 -1.159119 -0.134841
3  0.390528  0.166905

In [210]:
df.loc["G1"].loc[1]

a    1.693723
b   -1.706086
Name: 1, dtype: float64

In [216]:
df.index.names=["group","num"]

In [217]:
df

                  a         b
group num
G1    1   -0.754070 -0.943406
      2    0.484752 -0.116773
      3    1.901755  0.238127
G2    1    1.996652 -0.993263
      2    0.196800 -1.136645
      3    0.000366  1.025984

In [187]:
df.xs(1,level="num")

              a         b
group
G1     0.740122  0.528813
G2     0.955057  0.190794

In [246]:
df.loc['G2'].loc[2]['b']

-1.1366445936091856

# MISSING VALUES

In [270]:
d={"a":[1,2,np.nan],"b":[5,np.nan,np.nan],"c":[1,2,3]}

In [271]:
s=pd.DataFrame(d)

In [272]:
s

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [273]:
s.dropna()

     a    b  c
0  1.0  5.0  1

In [191]:
s.dropna(axis=1)

   c
0  1
1  2
2  3

In [274]:
s.dropna(axis=1,thresh=2)

     a  c
0  1.0  1
1  2.0  2
2  NaN  3

In [275]:
s.fillna("f")

     a    b  c
0  1.0  5.0  1
1  2.0    f  2
2    f    f  3

In [276]:
s

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [277]:
s.fillna(s["a"].mean(),inplace=True)

In [278]:
s

     a    b  c
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

# Group by

In [281]:
big={"company":["gog","gog", "mst", "mst", "fb" ,"fb"],"person":["sam", "charle", "amy" ,"van" ,"carl","sarah"],
     "sales":[200.,120.,340.,124.,243.,350.]}

In [282]:
zz=pd.DataFrame(big)

In [283]:
zz

  company  person  sales
0     gog     sam  200.0
1     gog  charle  120.0
2     mst     amy  340.0
3     mst     van  124.0
4      fb    carl  243.0
5      fb   sarah  350.0

In [312]:
arrays = [['Falcon', 'Falcon', 'Parrot', 'Parrot',"x","y"],
          ['Captive', 'Wild', 'Captive', 'Wild',"a","b"]]
index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))
kk = pd.DataFrame([390., 350., 30., 20.,60,70],
                  index,['max speed'])

In [313]:
kk

                max speed
Animal Type
Falcon Captive      390.0
       Wild         350.0
Parrot Captive       30.0
       Wild          20.0
x      a             60.0
y      b             70.0

In [286]:
kk.groupby("Animal").mean()

        Max Speed
Animal
Falcon      370.0
Parrot       25.0
x            60.0
y            70.0

In [256]:
big = {'company': ["gog", "gog", "mst", "mst", "fb", "fb"],
       'person': ["sam", "charle", "amy", "van", "carl", "sarah"],
       'sales': [200, 120, 340, 124, 243, 350]}

zz = pd.DataFrame(big)

# Clean 'sales' column to ensure numeric values


# Select numeric columns only
numeric_columns = zz.select_dtypes(include='number')

# Group by 'company' and calculate the sum of numeric columns for each group
sum_by_company = numeric_columns.groupby(zz['company']).sum()

print(sum_by_company)

         sales
company
fb         593
gog        320
mst        464

In [304]:
big = {'company': ["gog", "gog", "mst", "mst", "fb", "fb"],
       'person': ["sam", "charle", "amy", "van", "carl", "sarah"],
       'sales': [200, 120, 340, 124, 243, 350]}

In [305]:
zz = pd.DataFrame(big)

In [306]:
cc=zz.select_dtypes(include="number").groupby(zz["company"])

In [290]:
zz.groupby("company").count()

         person  sales
company
fb            2      2
gog           2      2
mst           2      2

In [291]:
zz

  company  person  sales
0     gog     sam    200
1     gog  charle    120
2     mst     amy    340
3     mst     van    124
4      fb    carl    243
5      fb   sarah    350

In [314]:
cc=zz.groupby('company')['sales'].mean()

In [315]:
cc

company
fb     296.5
gog    160.0
mst    232.0
Name: sales, dtype: float64

In [316]:
type(cc)

pandas.core.series.Series

In [299]:
bb=cc.reset_index()

In [300]:
bb

  company  sales
0      fb  296.5
1     gog  160.0
2     mst  232.0

In [317]:
type(bb)

pandas.core.frame.DataFrame

In [301]:
zz.select_dtypes(include="number").groupby(zz["company"]).mean()

         sales
company
fb       296.5
gog      160.0
mst      232.0

In [331]:
zz.groupby('company').describe().transpose()['fb']

sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: fb, dtype: float64

# merging,joining,concatnating

In [ ]:
#same rows concat
pd.concat([df1,df2])

In [ ]:
#same rows concat
pd.concat([df1,df2],axis=1)

In [ ]:
pd.merge(df1,df2,how='inner',on='columns')

In [ ]:
#for join on is index it self
df1.join(df2,how='')

# operations

In [ ]:
df['col2'].unique()

In [ ]:
df[].nunique()

In [ ]:
#times a each unique value appered in a column 
df[].value_counts()

In [ ]:
df.drop('col1',axis=1,inplace=True)

In [ ]:
df[].apply(function)

In [ ]:
df[].apply(lambda x:x*2)

In [ ]:
df.sort_values('')

In [ ]:
df.isnull()

In [ ]:
#mainly for making multi index 
#shift+enter for complete info
df.pivot_table()

# input and output

In [318]:
pwd

'C:\\Users\\asuna\\Downloads'

In [319]:
pd.read_csv("example")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [320]:
df=pd.read_csv("example")

In [321]:
df.to_csv("my_out",index=False)

In [322]:
pd.read_csv("my_out")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [323]:
df.to_csv("usless",index=True)

In [324]:
pd.read_csv('usless')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [325]:
pd.read_excel("sample.xlsx")

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [326]:
df.to_excel("sample2.xlsx",sheet_name="new")

In [327]:
x=pd.read_html("https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/")

In [328]:
type(x)

list

In [330]:
x[0].head(5)

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
1,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
2,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
3,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
4,Silicon Valley Bank,Santa Clara,CA,24735,First–Citizens Bank & Trust Company,"March 10, 2023",10539